---
kind: property
id: P:Autodesk.Revit.DB.Visual.Noise.NoiseColor1
source: html/9ae41868-dd27-3f90-7cf8-8dd660be9c1f.htm
---
# Autodesk.Revit.DB.Visual.Noise.NoiseColor1 Property

The property labeled "Color 1" from the "Noise" schema.

## Syntax (C#)
```csharp
public static string NoiseColor1 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.